import React from 'react';
import '../../css/LegalPages.css'; // Шлях до CSS

export default function TermsOfService() {
    return (
        <div className="legal-page-wrapper">
            <div className="legal-content">
                <h1>Умови використання</h1>
                <p>
                    Ласкаво просимо до Il Gambero Rosso! Ці Умови використання ("Умови") регулюють ваше використання веб-сайту Il Gambero Rosso ("Сайт") та послуг, що надаються через Сайт. Будь ласка, уважно прочитайте ці Умови перед використанням нашого Сайту.
                </p>

                <h2>1. Прийняття Умов</h2>
                <p>
                    Отримуючи доступ до Сайту або використовуючи його, ви погоджуєтеся дотримуватися цих Умов та всіх чинних законів і нормативних актів. Якщо ви не погоджуєтеся з будь-якою частиною цих Умов, ви не повинні використовувати Сайт.
                </p>

                <h2>2. Зміни в Умовах</h2>
                <p>
                    Ми залишаємо за собою право в будь-який час змінювати або замінювати ці Умови на власний розсуд. Ми повідомимо вас про будь-які значні зміни, розмістивши нові Умови на Сайті. Ваше подальше використання Сайту після внесення змін до Умов означає вашу згоду з такими змінами.
                </p>

                <h2>3. Використання Сайту</h2>
                <ul>
                    <li>Ви повинні бути повнолітнім, щоб використовувати цей Сайт та робити замовлення.</li>
                    <li>Ви погоджуєтеся використовувати Сайт лише в законних цілях і способом, який не порушує права, не обмежує та не перешкоджає використанню та насолоді цим Сайтом будь-якою третьою стороною.</li>
                    <li>Ви не повинні намагатися отримати несанкціонований доступ до будь-якої частини або функції Сайту або будь-яких інших систем чи мереж, підключених до Сайту.</li>
                </ul>

                <h2>4. Інтелектуальна власність</h2>
                <p>
                    Весь вміст на Сайті, включаючи, але не обмежуючись, тексти, графіку, логотипи, зображення, аудіо- та відеофайли, є власністю Il Gambero Rosso або його ліцензіарів і захищений законами про авторське право та торгові марки.
                </p>

                <h2>5. Замовлення та оплата</h2>
                <ul>
                    <li>Всі замовлення, розміщені через Сайт, залежать від наявності та підтвердження ціни замовлення.</li>
                    <li>Ми приймаємо різні способи оплати. Деталі оплати будуть вказані під час оформлення замовлення.</li>
                    <li>Ми залишаємо за собою право відхилити будь-яке замовлення, розміщене у нас.</li>
                </ul>

                <h2>6. Обмеження відповідальності</h2>
                <p>
                    Il Gambero Rosso не несе відповідальності за будь-які прямі, непрямі, випадкові, спеціальні або наслідкові збитки, що виникли внаслідок використання або неможливості використання Сайту.
                </p>

                <h2>7. Посилання на сторонні сайти</h2>
                <p>
                    Сайт може містити посилання на сторонні веб-сайти або послуги, які не належать або не контролюються Il Gambero Rosso. Ми не несемо відповідальності за вміст, політику конфіденційності або практику будь-яких сторонніх веб-сайтів або послуг.
                </p>

                <h2>8. Припинення</h2>
                <p>
                    Ми можемо припинити або призупинити ваш доступ до Сайту негайно, без попереднього повідомлення або відповідальності, на власний розсуд, з будь-якої причини, включаючи, без обмежень, порушення вами цих Умов.
                </p>

                <h2>9. Застосовне право</h2>
                <p>
                    Ці Умови регулюються та тлумачаться відповідно до законодавства України, без урахування її колізійних норм.
                </p>

                <h2>10. Зв'яжіться з нами</h2>
                <p>
                    Якщо у вас є будь-які запитання щодо цих Умов, будь ласка, зв'яжіться з нами за адресою: info@ilgamberorosso.ua.
                </p>
            </div>
        </div>
    );
}